[
    {
        "name": "System Design",
        "url": "/myblog/images/svgServices/old-library-building-svgrepo-com.svg",
        "description": "I design systems using clean code principles finding a balance between code readability, reusability, testability, maintainability, and simplicity.",
        "points": [
            "Knowledge in High-level architectures",
            "API design",
            "Database Design"
        ]
    },
    {
        "name": "Architecture",
        "url": "/myblog/images/svgServices/analytics-svgrepo-com.svg",
        "description": "I write code following the best practices taking advantage of good design patterns to ensure maintainable code. Using algorithms with reduced complexity to produce error-resistant, clean and readable code.",
        "points": [
            "Get the data foundation for data analysis.",
            "Automated data extraction"
        ]
    },
    {
        "name": "Web Design",
        "url": "/myblog/images/svgServices/browser-design-svgrepo-com.svg",
        "description": "I like to build aestetics sites with good user experience (UX) with the focus on the data and information to be displayed.",
        "points": [
            "The data is the protagonist"
        ]
    },
    {
        "name": "Data Analysis",
        "url": "/myblog/images/svgServices/coding-data-development-svgrepo-com.svg",
        "description": "I prioritize deep understanding of the data through exploratory data analysis (EDA), data cleaning, and visualization techniques before applying machine learning or deep learning algorithms. This ensures that models are built on solid, well-understood foundations",
        "points": []
    },
    {
        "name": "Visualization",
        "url": "/myblog/images/svgServices/presentation-chart-svgrepo-com.svg",
        "description": "I create clear exploratory and explanatory visuals using tools like D3 to make data insightful with good data visualization principles allowing data to speak for themself and tell us a story.",
        "points": []
    },
    {
        "name": "Security",
        "url": "/myblog/images/svgServices/security-protection-key-svgrepo-com.svg",
        "description": "I secure applications through authentication, encryption, input validation, and end-to-end data integrity. Making sure to respect security principles",
        "points": [
            "Confidenzialty",
            "Integrity",
            "Availability",
            "Autenticity"
        ]
    }
]